 var abc = prompt('Здравствуй😊 Давай поиграем в интеллектуальную игру. Ты не против? Хотя кто тебя спрашивает?😂 Начинаем...')
 console.log(abc);

 var def = prompt('Для начала введи свое имя😎')
 console.log(def);
 alert(def);

var voz = +prompt('Bведи свой возраст... Не переживай😏 Это не допрос😂')
 console.log(voz);
 alert(voz);

 var pros = prompt('Хорошо начнем с самого простого😉')
console.log(pros);

 var pl = prompt('3001+1308 🤨')
 console.log("3001+1308=4309 (Ваш ответ: )");
 alert('Незнаю как у тебя , но у меня получилось 4309😊' )

var otn = prompt('Теперь проверим, умеешь ли ты отнимать...😎')
 console.log(otn);

 var min = prompt('3001-1308 🤓')
 console.log('3001-1308= 1693 (Ваш ответ: )');
 alert('Ответ: 1693 . Сверяй со своим ответом ')

 var min = prompt('Хорошо идем дальше😍😍😍')
 console.log(min);

 var mno = prompt('30*13')
 console.log('13*30=390 (Ваш ответ: )' );
 alert('Ответ: 390')

 var de = prompt('Делить умеешь?😏')
 console.log(de);

 var del = prompt('2525/5')
 console.log('2525/5=505 (Ваш ответ: )');
 alert('Если ты написал 505 , то + 1 балл в твой счет😍')

 var pro = prompt('И на последок🤨')
 console.log(pro);

 var proc = prompt('34%5')
console.log('34%5=4 (Ваш ответ: )');
alert('Кажется ты великий математик... ')

var proc = prompt('Считаем баллы...')
console.log(proc);
alert('Молодец🥰 Ты победил👏')
alert('Игра окончена🥳🥳🥳 Можешь повторить, если хочешь😏')





